<script setup lang="ts">
import {ref} from "vue";
import {Search} from '@element-plus/icons-vue'

defineProps<{ msg: string }>();

const question_list = ['1.请问中华民族发展史上开天辟地的大事是什么？', '2.请问在共产党历史上被称为三大战役的分别是？', '3.1937年()事变爆发，全面抗战由此开始。', '4.标志着中国共产党开始独立领导革命战争和创建人民军队的事件是？', '5.全面抗战暴发后，八路军打的第一个大胜仗是()', '6.中国革命的三大法宝', '7.“中国共产党”这一称谓的最早提出者是()', '8.请指出我国的立国之本是？', '9.请问中国近代革命的一个最根本任务是？', '10.党的十九大最深远的贡献是什么？', '11.请指出新中国确立的第一部宪法的时间？', '12.请问《中共中央关于构建社会主义和谐社会若干重大问题的决定》是什么时候通过的？', '13.请指出四个全面战略布局的内涵是？', '14.请指出和平共处五项原则的完整内容？', '15.请问毛泽东深刻总结中国革命经验教训、基于中国革命实际提出的重要论断是什么？', '16.党的性质', '17.党的根本宗旨', '18.党的指导思想', '19.党的最高理想和最终目标', '20.现阶段我国社会的主要矛盾', '21.党执政兴国的第一要务', '22.党在社会主义初级阶段的基本路线', '23.四项基本原则', '24.和平共处五项原则', '25.党的二十大的主题', '26.“三个务必”', '27.三件大事', '28.中国共产党的中心任务', '29.全面建成社会主义现代化强国“两步走”战略安排', '30.社会主义民主政治的本质属性', '31.“五个必由之路”', '32.“两个 确立”', '33.“四个意识”', '34.“两个维护”', '35.“四个自信”', '36.“两个一百年”奋斗目标', '37.“五位一体”总体布局', '38.“四个全面”战略布局', '39.在五大新发展理念中，最能体现坚持以人民为中心的发展思想的是()。', '40.中国共产党十一届三 中全会确定把党的工作重心转移到()上来。', '41.决定成立国家安全委员会的是()。', '42.把生态文明建设纳入中国特色社会主义事业总体布局的是()', '43.我国的基本国情', '44.我国的根本政治制度', '45.我国的基本政治制度', '46.社会主义民主政治的本质和核心', '47.当代中国发展进步的根本方向', '48.党和国家工作总基调', '49.社会主义现代化建设的三个重要支点', '50.社会主义基本经济制度', '51.新时代坚持和发展中国特色社会主义的根本动力', '52.全面深化改革总目标', '53. 全面深化改革的出发点和落脚点', '54.全面推进依法治国总目标', '55.社会主义核心价值观', '56.党在新时代的强军目标', '57.保持香港、澳门长期繁荣稳定的方针', '58.“一带一路”', '59.“两不愁三保障”', '60.中国特色社会主义事业的领导核心', '61.党的生命线和根本工作路线', '62.改革开放以来党的全部理论和实践的主题', '63.党治国理政第一位的任务', '64.党的群众路线', '65.党的基础性建设', '66.党的根本性建设', '67.党的政治建设的首要任务', '68.党面临的“四种危险”', '69.党面临的“四大考验”', '70.“四风”问题', '71.“三严三实”', '72.2020年年打好脱贫攻坚战，要一鼓作气，重点解决好实现“两不愁三保障”面临的突出问题。“两不愁三保障”分别指的是()、()，()()和()有保障。', '73.党员如果没有正当理由，连续()个月不参加党的组织生活，或不交纳党费，或不做党所分配的工作，就被认为是自行脱党。', '74.党龄应该从哪天算起？', '75.“两学一做”', '76.党风廉政建设的“两个责任”', '77.中国共产党人的初心和使命', '78.“一带一路”是什么的简称？', '79.习近平主席在2023年3月5日参加江苏省代表团审议时强调全面建设社会主义现代化国家的首要任务是什么？', '80.习近平主席在十四届全国人大一次会议上提出他前进的最大动力是什么？', '81.习近平主席在2023年3月6日参加联组会时强调要把谁和谁当作自己人？', '82.2018年10月8日，诺贝尔经济学奖揭晓，授予美国经济学家威廉·诺德豪斯和保罗·罗默，以表彰他们在()作出的突出贡献。', '83.1959年10月1日，在国庆10周年阅兵式上，“____”检阅车也首次亮相国庆阅兵式。', '84.2022年6月4日，据中国载人航天工程办公室消息，神舟十四号瞄准6月5日10时44分发射。请写出神舟十四号3名航天员中任意2位的名字__________________', '85.郎平作为20世纪80年代中国女排主力队员，和其他队员一起创造了“五连冠”的奇迹，如今又把中国女排重新带上巅峰。郎平和她的队友塑造了一种精神，这种精神的名称是___________。', '86.()是中国核武器研制工作的开拓者和奠基者，被誉为“两弹元勋”', '87.中科大潘建伟教授团队，与合作者利用“_______”量子科学卫星，首次实现距离7600公里的洲际量子密钥分发。', '88.2015年4月2日，由吴京主演并执导的电影____在全国上映，作为国内首部3D动作战争电影，让堪称“东方之狼”的特种兵战队及高能战士首次登陆大银幕。', '89.2017年，由刘伟强执导，刘烨、朱亚．文等人主演，为庆祝人民解放军建军90周年的献礼影片是____。', '90.2018年11月5日，首届中国国际进口博览会在上海开幕，中国国家主席习近平在开幕式上发表主旨演讲时提到，将支持____并上升为国家战略。', '91.2018年4月13日，与法国科学家安娜· 德尚、于克·德戴共同在瑞典首都斯德哥尔摩获得舍贝里奖的中国科学家是____。', '92.世界节能和利用新能源、可再生能源第一大国是()', '93.奥运五环旗中的黄色环代表()。', '94.学雷锋纪念日是每年的()。', '95.2019年1月25日，习近平总书记在中共中央政治局第十二次集体学习时强调，全媒体不断发展，出现了全程媒体、全息媒体、全员媒体、全效媒体，信息无处不在、无所不及、无人不用。其中，____意味着突破了时空尺度，零时差、“五加二”、“白加黑”，传播随时随地都可以发生。', '96.2019年2月18日，中共中央、国务院印发的《粤港澳大湾区发展规划纲要》，是指导粤港澳大湾区当前和今后一个时期合作发展的纲领性文件。规划近期至____年，远期展望到____年', '97.2022年北京冬奥会会徽为____。', '98.嫦娥四号探测器是 用那个型号的火箭发射的？', '99.嫦娥四号探测器是在我国()发射基地发射成功的。', '100.目前世界上共有4个卫星导航定位系统，我国的是()导航定位系统。']
const left_question_number = ref(question_list.length)
const used_question_list = ref([-1])
const total_question_number = ref(question_list.length)
const question = ref("")
const centerDialogVisible = ref(false)

function new_question() {
  if (left_question_number.value == 0) {
    alert("所有题目均已抽取完毕，请刷新页面！")
    return
  }
  let index = -1;
  let min, max;
  while (used_question_list.value.indexOf(index) != -1) {
    min = Math.ceil(1);
    max = Math.floor(total_question_number.value);
    index = Math.floor(Math.random() * (max - min + 1)) + min;
  }
  used_question_list.value.push(index)
  left_question_number.value--
  question.value = question_list[index - 1]
  centerDialogVisible.value = true
}
</script>

<template>
  <el-dialog v-model="centerDialogVisible" width="70%" center>
    <span style="font-size: 50px">
      {{ question }}
    </span>
    <template #footer>
      <span class="dialog-footer">
        <el-button round style="font-size:40px;width: 150px;height: 80px" type="danger" @click="centerDialogVisible = false">
          关闭
        </el-button>
      </span>
    </template>
  </el-dialog>

  <h1 style="font-size: 70px" color="#409EFF">2023下半年发展对象答辩抽题系统</h1>
  <br><br>

  <!-- example components -->
  <div class="mb-4">
    <el-button :icon=Search type="primary" round style="width: 320px;height: 120px;font-size: 70px" size="large"
               @click="new_question()">抽取
    </el-button>
  </div>
  <br><br>
  <div>
    <el-tag style="font-size: 30px;width: 250px;height: 60px" type="success" class="m-1">
      题库总数：{{ total_question_number }}
    </el-tag>
    <el-tag style="font-size: 30px;width: 250px;height: 60px" type="info" class="m-1">剩余题目：{{
        left_question_number
      }}
    </el-tag>
  </div>

</template>

<style>
.ep-button {
  margin: 4px;
}

.ep-button + .ep-button {
  margin-left: 0;
  margin: 4px;
}
</style>
